import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-news-activities',
  templateUrl: './news-activities.component.html',
  styleUrls: ['./news-activities.component.css']
})
export class NewsActivitiesComponent implements OnInit {
  news:Array<{
    'title':string,
    'date':string,
    'img':string,
    'describe':string
  }>=[
    {
      title:'محطات وإنجازات 2021/2022',
      date:'يوليو 24, 2022',
      img:'../../../../assets/images-guest/new1.png',
      describe:'السنة التحضيرية في معهد أوميغا - أوميغا جولد محطات وإنجازات 2021/2022 بإمكانكم الاطلاع على كتيب محطات وإنجازات أوميغا جولد 2021/2022'
    }
    ,
    {
      title:'بدأنا التسجيل للفصل الجديد',
      date:'فبراير 8, 2022',
      img:'../../../../assets/images-guest/new2.jpg',
      describe:'بدأنا التسجيل للفصل الجديد مستويات א, ב, ג, ד بالفترات الصباحية والمسائية الفصل يبدأ بتاريخ ٢٠/٢/٢٢ وينتهي بتاريخ ٢/٦/٢٢ في أوميغا نتعلم استخدام اللغة العبرية،بطريقة أخرى للاستفسار والتسجيل بإمكانكم ترك تفاصيلكم عن طريق الرابط، أو الاتصال 025326484 https://forms.gle/wWM7xF5Hxg7XJaT67 معهد أوميغا- الشيخ جراح، عمارة الشابات طابق ٤'
    }
    ,
    {
      title:'جولات استخدام اللغة العبرية على أرض الواقع',
      date:'يناير 18, 2022',
      img:'../../../../assets/images-guest/new3.jpg',
      describe:'جانب من جولات استخدام اللغة العبرية على أرض الواقع لمستويات الف وبيت. في أوميغا نتعلم استخدام اللغة العبرية على أيدي طاقم مؤهل من أفضل معلمي العبرية كلغة ثانية.'
    }
    ,
    {
      title:'جولة قسم من طلاب السنة التحضيرية في الجامعة العبرية',
      date:'يناير 8, 2022',
      img:'../../../../assets/images-guest/new4.jpg',
      describe:'جانب من جولة قسم من طلاب السنة التحضيرية أوميغا جولد في المكتبة الوطنية في الجامعة العبرية – جفعات رام. تعرف الطلاب على تاريخ المكتبة ومجموعات الكتب والمخطوطات التاريخية كما وتلقوا محاضرة عن مجموعات كتب التاريخ الإسلامي الموجودة في المكتبة وقاموا بالتجول والاطلاع على مجموعات الكتب المختلفة. هذه الجولة هي جزء من عدة جولات لطلاب السنة التحضيرية للتعرف على مؤسسات التعليم العالي التخصصات وشروط القبول.'
    }
  ]
  constructor() { }

  ngOnInit(): void {
  }

}
